import { PrismaClient } from '../app/generated/prisma'

const prisma = new PrismaClient()

export async function main() {
  await prisma.wisdom.createMany({
    data: [
      {
        source: 'Парацелз',
        topics: ['Здраве'],
        text: 'Бог е правилният лекар и самият Той е лекарството.',
      },
      {
        source: 'Парацелз',
        topics: ['Здраве'],
        text: 'Великата основа на истинското лекарство е Любовта.',
      },
      {
        source: 'Парацелз',
        topics: ['Здраве'],
        text: 'Всяко лечение трябва да идва от силата на сърцето.',
      },
      {
        source: 'Парацелз',
        topics: ['Здраве'],
        text: 'Единствения, който прави истинския лекар - лекар е Бог.',
      },
      {
        source: 'Парацелз',
        topics: ['Здраве'],
        text: 'Веселието може да лекува, а голямата печал да убива.',
      },
      {
        source: 'Парацелз',
        topics: ['Здраве'],
        text: 'Главната причина за всички болести е, че не сме в Бога.',
      },
      {
        source: 'Парацелз',
        topics: ['Здраве'],
        text: 'Първо си Посветен, после лекар. Това е подредбата.',
      },
      {
        source: 'Парацелз',
        topics: ['Здраве'],
        text: 'Трябва да се лекува съзнанието на човека, а не тялото му.',
      },
      {
        source: 'Парацелз',
        topics: ['Здраве'],
        text: 'Човек не може да знае какво богатство е здравето, ако не е бил болен.',
      },
      {
        source: 'Парацелз',
        topics: ['Здраве'],
        text: 'Най-благородната основа на лекарството е Любовта. Дълбоката основа.',
      },
      {
        source: 'Парацелз',
        topics: ['Здраве'],
        text: 'Болестите са ни пратени от Бог и пак чрез Него трябва да бъдат лекувани.',
      },
      {
        source: 'Египет',
        topics: ['Здраве'],
        text: 'Здравето е море от светлина.',
      },
      {
        source: 'Египет',
        topics: ['Здраве'],
        text: 'Здравето е познаване на пътя.',
      },
      {
        source: 'Египет',
        topics: ['Здраве'],
        text: 'В Бога е скрито всяко лечение.',
      },
      {
        source: 'Египет',
        topics: ['Здраве'],
        text: 'Мъдрото Слово е тайно лекарство.',
      },
      {
        source: 'Египет',
        topics: ['Здраве'],
        text: 'Божието име е вкусът на здравето.',
      },
      {
        source: 'Египет',
        topics: ['Здраве'],
        text: 'Благата дума е духовно лекарство.',
      },
      {
        source: 'Египет',
        topics: ['Здраве'],
        text: 'Здравето е тайна на слънчевия разум - Там, където влезе Бог, болестта умира.',
      },
    ],
  })

  console.log('Seed completed successfully')
}

main()
  .catch((e) => {
    console.error(e)
    process.exit(1)
  })
  .finally(async () => {
    await prisma.$disconnect()
  })
