import { PrismaClient } from '../app/generated/prisma'

const prisma = new PrismaClient()

export async function main() {
  await prisma.prayer.create({
    data: {
      id: 'lozinka',
      title: 'Лозинка',
      source: 'Учителят',
      series: ['Молитвена Хранилница'],
      rank: 4,
      content: [
        'I. За прославлението и осветяването името на Господа Бога нашего на земята между человеците и верующите, и избраните от Веригата на Господа на словото - Спасител, Покровител, който въздига и Възкресява мъртвите и туря всичко в ред и порядък навсякъде. И да се благослови името на Господа Исуса Христа, изявеното слово Божие, и с Него всички, които Го любят.',
        'II. За идването на царството Божие на земята между человеците и в сърцата на верующите, и в душите на избраните. И да се тури в действие всяка правда, всяка доброта, всяка любов, всяка мъдрост и всяка истина. И да се възцари Господ Бог наш и да се изпълнят думите на Господа: „Отец е благоволил да Ви даде Царство“. И да се всели Духът на Господа Исуса Христа между нас. И да се изпълни предвечното намерение на Отца нашего на светлините и на светлите духове, комуто да бъде слава и чест, u поклон сега и всякога, и през всичките векове.',
        'ІІІ. За изпълнението на волята на Господа Бога нашего на земята, kakmo e горе на небето между светлите ангелски ликове. И да се въдвори законът на истината, любовта и правдата, за да бъдем всички в едно тяло и в един дух. И да се въдвори ред u съзвучие, и хваление, да ни се даде знание да го славим и да се радваме всички на Господа и Неговите дела. И да се всели Той в нашия живот и в делото на ръцетe ни. Да даде живот и здраве, и дългоденствие на всички, които Нему уповават, и да ги избави от всички напасти на злото и лукавия, да внесе мир в 72 душите им, да им даде изобилие на своите благости. Да си спомни Господ Бог наш своите обещания, да се смили над всички страдающи, да благослови всички верующи, ga ykpenu своите избрани, да им даде сила и знание, мъдрост и любов, да побеждават заради Него и Неговото свято име. Да ни даде победа над всичките ни врагове, да победим докрай и да послужим на Господа с радост и веселие през всичките дни на нашия живот. Да ни озари с виделината на своето лице, да ни направи силни и крenku ga mворим добрата Му воля, умни и незлобливи да ходим пред Него с пълнота. Да изцели всичките наши страдающи братя и сестри, да благослови домовете им и децата им с тях наедно, да благослови всичките им добри начинания на душата и духа u maka ga се въздигне Господ Бог наш в нас, както е горе в небето.',
        'Амин',
      ].join('\n\n'),
      notes: [
        'Лозинка е остаряла форма на думата "клетва".',
        'В Молитвената Хранилница под тази молитва е записано:',
        'Тези са те, основните точки, върху които можем да градим. Всякой ден в час, в който вие ще си изберете, по-предпочитателно е сутрин, ще четете тази лозинка - било само първата част, било втората, било само третата, па било и трите заедно. Ако четете цялата лозинка, то първата и част ще произнесете сутрин, втората на обед, а третата - вечер. А когато четете по една част на ден, тогава произнесете ги в три последователни дни. Всякой ще се моли според диктовката на духа си и Господ ще ви покаже и упъти как да се молите. В духовния свят вие не се намирате в еднаква зона, нито всички - на едно и също място, така щото според изгрева на Вашето слънце ще се молите. Повелението на Духа е чрез тази лозинка всякой ден да се ограждате и затова ежедневно трябва обезателно да я четете по един от Казаните начини.',
        'Трябва да знаете, че нам е необходимо да изговаряме името на Исуса Христа за нас и за другите. Защото това име предизвиква онези принципи във вселената, които творят, които принципи са Божествени и носят милост и благост. Йод Хей Вав Хей - тъй се произнасят на еврейски тези велики принципи и природни сили, които в своите разклонения носят благословенията на света, ако правилно се зачитат и разбират. Ние трябва да произнася ме името на Господа Исуса Христа, защото то е, което съдържа равновесие в природните закони. И с произнасянето му съзнателно и с благоволение повикваме деветте ангелски чина да работят всичките заедно. (Дадена на 1 август 1914 г. в 15:30 ч. при годишната среща на Веригата)',
      ].join('\n\n'),
    },
  })
}

main()
  .catch((e) => {
    console.error(e)
    process.exit(1)
  })
  .finally(async () => {
    await prisma.$disconnect()
  })
