import { PrismaClient } from '../app/generated/prisma'

const prisma = new PrismaClient()

export async function main() {
  await prisma.book.create({
    data: {
      id: 'moeto-skrito-dao',
      title: 'Мoeto Скрито Дао',
      author: 'Елеазар Хараш',
      yearPublished: 2019,
      notes: [
        'Вглъбяването в Дао преодолява Вселената. Лекотата е вкусът на Дао. Прекрасно е да изчезнеш в Изчезналия! Само Дао ме насища. Дао ми подари изчезването. Дао ме научи да дишам Дао. Ураганът за Дао е като Покоя.',
        'Варна, 2019 г.',
        'ISBN 9786197449280 Издател: •Светът на книгите• ООД, Варнa',
      ].join('\n\n'),
      chapters: {
        create: [
          {
            id: 'krasivoto-nerazbirane',
            title: 'Красивото неразбиране',
            number: 1,
            notes: 'Предговор',
            content: {
              create: {
                text: [
                  'Разбира се, че не Го разбирам, затова Го живея.',
                  'Дао е моята безмълвна Тайна.',
                  'В Дао съзрях цялата Неизречимост, и се изпълних с усет за Чисто Вдъхновение.',
                  'Дао е красивото скрито в Нищото.',
                  'Чувам Дао с Неговото Ухо – аз си нямам слух.',
                  'Разбрах, че когато помагам на себе си, не си помагам. Разбрах, че когато Дао ми пречи, ми помага.',
                  'Когато съм в Дао всичко е наред. Когато съм в себе си, все нещо ми липсва.',
                  'Чудно е Дао, защото не мога да Го разбера. Чувствам се прекрасно в своето неразбиране!',
                  'Все се взирам в Дао, но не Го виждам, но Дао всякога ме вижда с лекота.',
                  'Дао ми каза: Ако искаш да ме чуеш, трябва да се откажеш от себе си.',
                  'За да чуя Дао, трябва да съм в Дао.',
                  'Ако съм в Дао – съм несътворен.',
                  'Дао е като мед в устата ми.',
                  'Не мога да пипна Дао, но Дао умее да ме докосва.',
                  'Само към Дао се стремя. Дао успя да ме привлече.',
                  'Когато жадувам за Дао, Дао оживява в мене.',
                  'Дао е живо, а аз само си въобразявам, че живея.',
                  'Дао е в мене, а аз все повече се приближавам към себе си.',
                  'Ако имам Дао, всичко имам, но как става това не знам.',
                  'Дао умее да ми дава Себе Си, а аз не успявам да Му дам себе си, но Дао ще ме научи.',
                  'Когато се доверявам на Дао, все едно е каква трудност срещам.',
                  'Не знам кога Дао е вътре в мен, но ако Дао се издаде, тогава Го узнавам.',
                  'Дао ми даде да пия от Покоя, това е чудно питие!',
                  'Ако можех да увличам, бих увлякъл целия свят в Дао, но това е само в Негова власт.',
                  'От Дао избликва Неизговоримост.',
                  'Едно жадувам само: Дао да е увлечено по мене!',
                  'Трудно се постига Дао – трябва да си се отказал от света.',
                  'Преди да искам Покоя, желая Дао.',
                  'Ако не си в Дао, познанието ти е напразно.',
                  'Човекът на Дао е потайно, отречено Същество.',
                  'Ако не отидеш Отвъд, не можеш да познаеш Дао.',
                  'Тайната на живота е: да вселиш Дао във всичко.',
                  'Ако се вкореним в Дао, ще изкореним греха и злото.',
                  'Когато надраснеш нещата – Дао ти става Вечен Приятел.',
                  'Няма добър съвет за този, който се е отказал от Дао.',
                  'Който честно и усърдно търси Дао, вече е призован.',
                  'Когато си в Дао, съмнението е невъзможно.',
                  'Любовта към Дао превъзхожда и най-правилната постъпка.',
                  'Дао е Свещено, а това е нещо повече от култура.',
                  'Дао е това, което ни прави предани към Него.',
                  'Човекът на Дао търси Пустотата и отстранява Празнотата.',
                  'Дао е неуловимо, защото не се изяснява.',
                  'Дао решава дали да Го възприемеш и да Го усетиш.',
                  'В своите разумни усилия виж Дао.',
                  'АУМЪ',
                  'Елеазар Хараш',
                  'Варна, 2019 г.',
                ].join('\n\n'),
              },
            },
          },
        ],
      },
    },
  })
}

main()
  .catch((e) => {
    console.error(e)
    process.exit(1)
  })
  .finally(async () => {
    await prisma.$disconnect()
  })
