import { PrismaClient } from '../app/generated/prisma'

const prisma = new PrismaClient()

export async function main() {
  await prisma.book.create({
    data: {
      id: 'akordirane-na-choveshkata-dusha-1',
      title: 'Акордиране на човешката душа - Том 1',
      author: 'Боян Боев',
      yearPublished: 2007,
      series: ['Акордиране на човешката душа'],
      shortNotes: '14 беседи от 1914 г.',
      notes:
        'От архива на БОЯН БОЕВ (17.Х.1883 – 23.XП.1963). Издателство “Бяло Братство“, ISВN 978-954-744-087-6. Том I Второ издание. Редакционна колегия: Боян Д. Боев, Димитър Калев, Емилия Иванова',
      numberInSeries: 1,
      chapters: {
        create: [
          {
            id: 'velikata-sreda',
            title: 'Великата Среда',
            number: 1,
            content: {
              create: {
                text: [
                  'На 9 септември 1935 г. Учителя потегли за Мусала с една малка група от седмина братя. В Боровец натоварихме багажа на коне и поехме пеш към върха. По пътя, във време на почивките, имахме интересни разговори с Учителя. Ето някои съхранени мисли от тях.',
                  'Който уповава на светското, на материалното, той непременно в края на краищата ще се разочарова. И който уповава на духовното, но с користни цели, за да уреди своите лични работи, той също ще се разочарова. Само онзи, който уповава безкористно на духовното, не ще се разочарова. Това е Божественото.',
                  'Сега Бялата раса минава колективно през фазата на алчността (напр., италианците в Абисиния), а пък българинът минава индивидуално през алчността; разбира се, Невидимият свят използва всичко това пак за добро.',
                  'Някога Мусала е бил най-високият връх в Европа, после се е снишил. На няколко пъти България е била море и суша, обаче Рилският масив всякога е оставал суша и е стърчал като голям остров над водите.',
                  'Следобед стигнахме до х. Мусала, където пренощувахме и на другия ден рано сутрин потеглихме към върха. На връх Мусала при изгрева на Слънцето Учителя прочете Второ послание на ап. Петър към коринтяните. След молитвата почна разговор.',
                  'Първата проява на Бога, която знаем, е Любовта. Бог е Любов. От звездите, от Слънцето, от плодовете иде Божията Любов. Любовта е зад въздуха, зад водата, зад крушите, зад ябълките, зад хляба. И затова всяка форма, която срещаме, нека да ни бъде като съединителна връзка, чрез която да се свържем с онова, което е зад 9 ВЕЛИКОТО РАЗУМНО НАЧАЛО нея, а именно – с Любовта на Бога. Ето защо, когато възприемаме въздуха, водата, ябълката, крушата, хляба, когато наблюдаваме звездите, камъните, цветята, трябва да се свържем с онова, на което те са проводник. И ако при яденето, ние направим връзка с Любовта на Бога, тогава сме яли добре. И ако при дишането ние се докоснем и приемем Любовта, която е зад въздуха, тогава ние сме дишали добре. И ако при отправяне на поглед към Природата, ние се докоснем до Любовта, която е зад нейните форми, тогава ние сме ги гледали добре. Засегнал съм Любовта от всички страни. Тя е всепроницающа и е велика среда, в която сме потопени. И в най-дребните същества, и в атомите, и в силите – навсякъде се вижда нейното влияние в една или в друга форма. Виждам чешма и в нея откривам Любовта. Онзи човек, като я съграждал, е мислил доброто на хората. Виждам един извор и това го наричам Любов. Някое разумно същество го е пуснало към нас. Виждам, че изгрява Слънцето и намирам, че това е Любов, понеже някое Висше същество издига нагоре нашето светило. Това е Любовта, която стои зад Слънцето. Виждам дървото как расте – Любовта е там, която го кара да израства. В малките неща Любовта е силна. Навсякъде виждам какъв промисъл има – зад всички неща да стои Божията Любов. Човек издържа страданията заради Любовта. За тази Любов, която Бог има към Христос, Той издържа страданието. Значи страданията не са по-силни от Любовта. Казва Христос: „Докрай ги възлюбих.“ И на друго място: „Не се моля за света, а за тези, които ми даде, и за тези, които чрез тях ще повярват.“ Един мъченик го режат на късове и той издържа чрез Божията Любов. Любовта е над смъртта.',
                  'В Братството трябва да се образува група поне от дванадесет души, които да разбират Любовта и да бъдат нейни проводници. Любовта е светлината на Живота. Живот без Любов е безсмислен. Христос е казал: „Да се обичате един друг. И по това ще познаят, че сте мои ученици.“ Някой проповедник ще цитира Исайя, обаче за Божествената Любов нито дума не става. И после той не говори по кой начин и при кои условия Исайя е получил това, което е писал.',
                  'Сега хората не се познават. Чрез Любовта има едно дълбоко познание между хората. Всичко е Любов! Божията Любов всичко предшества. Преди да бъде вяра, Любов е. Животът се произвежда от Любовта и той е само едно условие, за да се прояви тя. Целият свят е въплъщение на Любовта и е произлязъл от нея. Затова първият подтик на човека трябва да бъде да възприеме Любовта. Ти като кажеш, че Слънцето не мисли за теб, се обезсърчаваш. Първо, ти не казваш право, защото баща ти и майка ти са мислили за теб и затова живееш. Второ, ако имаш братя и сестри, те не мислят както ти искаш, но те мислят за теб. Но може би и други мислят за теб, но ти не го съзнаваш. Въздухът мисли за теб, понеже влиза в белите ти дробове. Слънцето мисли за теб, понеже те огрява. Водата мисли за теб и дървото също мисли за теб. Като минаваш покрай тях, те ти казват: „Добре дошъл!“',
                  'Всеки ден Слънцето и звездите трептят да видят някого. Малките буболечки трептят да кацнат на някого. Дърветата също трептят да дойде някой човек да вземе от плодовете им, а пък казвате, че няма кой да ви обича.',
                  'След този разговор влязохме в наблюдателницата, за да пием чай. Като излязохме пак на открито, Учителя продължи:',
                  'Енергиите от планините слизат долу в полето, за да го направят плодородно. В бъдеще планините ще се снишат, а полетата ще се издигнат на планини.',
                  'Учителя погледна оттатък Мусала към боровите гори, отвъд долината на река Бели Искър, и каза:',
                  'Ето чисти места, там живеят Същества. Изобщо Съществата обичат места, където не стъпва човешки крак, за да не ги безпокоят. Те знаят изкуството да стават видими и невидими. Тук имат жилища и живеят полуфизически и полуастрален живот. Тези същества са били някога хора. Те са служебни същества, служители на други понапреднали Същества, които са завършили своето развитие и направляват всичко в Природата.',
                  'Етерът прониква въздуха. Нещата едно друго се проникват. Това, което прониква, то владее. По-малкото живее в по-голямото. По-голямото го обгръща. Етерът има четирисъстояния. Мислят, че етерът е еднороденнавсякъде, а пък то не е така. Слънцата са центрове на етерни енергии. Налягането на етера образува слънцата. Където има слънца, налягането на етера е най-голямо. Етерът като наляга, в безконечното пространство се образуват слънчеви системи; значи това налягане не е навсякъде еднакво.',
                  'Когато се качваш на висока планина, вътрешното налягане е по-силно отколкото външното. В такъв случай, ако дойде някой по-чувствителен на голяма височина, почва да му тече кръв. Затова именно, когато вървиш отдолу нагоре, ти трябва да се приспособиш постепенно и да се уравновесят външното налягане и вътрешното разширение. Трябва да се спираш от време на време по 30 секунди, за да дойде това уравновесяване.',
                  'Има едно Братство, което пътува в света и носи култура. То е било в Индия, в Египет, във Вавилон, в Персия, в Палестина, в Гърция, в Рим, във Франция, в Англия, в Германия и сега се премества у славяните. Където дойде, има култура, всичко се движи и се развива.',
                  'Българите казват, че когато човек изгуби Любовта си, става тромав, тежък; и са прави. Тогава отвътре няма разширениеивъншниятсвятналяга. Колкотоедносъщество живее в по-гъста среда, толкова то е по-низше. Например къртовете, понеже живеят в пръстта, са по-низши, а има същества, които живеят в земната кора и се ползват от особени лъчи.',
                  'Досега нашата Слънчева система с всички свои планети е слизала. А днес върви във възходяща степен, дига се нагоре и следователно скоро ще влезе в една нова област, която отговаря на една Нова култура.',
                  'Изчисляват, че цялата Вселена приличала на яйце, на което вътрешната вместимост е равна на стотици милиона светлинни години. И старите окултисти са казвали, че Вселената приличала на много голямо яйце. Една Божия годинаеравнанаединицаспетнадесетнули. На 365 милиона години Бог слиза веднъж, за да уреди работите. Под думата слизане се разбира насочване на съзнанието.',
                  'Сегашните хора ще станат Ангели. Ангелите се различават един от друг по степента на своето развитие – еволюцията, която са минали. Когато сегашните Ангели, които ни помагат, са минавали през фазата на човечеството, сегашните хора са били като растения и животни и тогавашните хора са се ползвали от тях, а сега идват да помагат на днешните хора, за да им се отплатят. Ангелите се съобщават с хората по закона на вдъхновението и така им предават своите мисли. Ангелите ни разбират и не бива да им създавамепрепятствия, за да могат данипредадат своята мисъл. Енергиите на Ангелите са толкова грамадни, че те са се оттеглили от хората, за да не им направят пакост. Дойдат ли Ангели при хора, които не са готови, последните падат в несвяст. Нали като дойдоха при Христа в Гетсиманската градина, за да Го хванат, паднаха на земята и Той отслаби енергията си, за да не им препятства.',
                  'Черната ложа иска да тури хората в стълкновение с Божествения свят, за да ги осакати. У религиозните хора има една опасност – имат честолюбие. У учените – също. А за Христа се казва: „Той прие рабски образ“; значи имаше 13 ВЕЛИКОТО РАЗУМНО НАЧАЛО смирение. Считаш, че един човек е долен, а пък у него Бог живее. Ти ще се обмениш с него, инак се израждаш. Навсякъде е Божественото, ако разбираме нещата.',
                  'Един брат попита Учителя: „От кога започнахме да слизаме с Вас на групи?“',
                  'Откакто слязохте от Луната. От Слънцето сме слезли на Луната и от Луната сме слезли на Земята. Има една група, която винаги идва с Учителя. От началото, откакто Учителя слиза на тази Земя, оттогава една група ученици слизат заедно с Него. При всички велики събития вие се събирате на едно място и идвате с Учителя. А пък когато няма велики събития, членовете на тази група се разпръскват по разни места и се прераждат. И после, като се съберат пак заедно, си обменят опитностите.',
                  'Човек не трябва да казва нито една груба дума, нито да има груба мисъл, понеже с това се руши Любовта в него; не че се руши, но тя се отдалечава и човек остава изоставен. За да не те изостави Любовта, не казвай груби думи, нито храни груби мисли.',
                  'Сега е дошло време Черната ложа да се оттегли и Бялата да взема надмощие. Ние сме изпратени на Земята, за да се прослави Името Божие.',
                  'На слизане от Мусала се спряхме за малко при рекичката, която се спуска от най-горното езеро „Окото“. Там Учителя каза:',
                  'Изида е символ на Истината, която беше забулена, а пък ОзирисепредставителнаизгряващотоСлънце. Всекитрябва да мине през Изида, за да дойде до Озирис. Изида беше жена. „Който разбули Изида, трябва да умре!“ Един велик адепт дигнал булото на Изида, видял красотата на нейното лице, но не умрял, понеже знаел законите. Който разбули Изида, може да отиде при Озирис. Озирис е проповядвал за Слънцето. Изида и Озирис са живеели в предисторическата епоха. Те после стават символи на египетските школи. Забулената Изида представлява Истината, която се крие. Във всеки човек има една забулена Изида. Това е душата, Божественото, свещеното в човека. Да познаеш душата в човека, това е вече посвещение.',
                ].join('\n\n'),
              },
            },
          },
        ],
      },
    },
  })
}

main()
  .catch((e) => {
    console.error(e)
    process.exit(1)
  })
  .finally(async () => {
    await prisma.$disconnect()
  })
