import { PrismaClient } from '../app/generated/prisma'

const prisma = new PrismaClient()

export async function main() {
  await prisma.wisdom.createMany({
    data: [
      {
        source: 'Ибн Араби',
        topics: ['Молитвата'],
        text: 'Истинската молитва е да се превърнеш Целия в Сърце - тогава Бог ще те чуе.',
      },
      {
        source: 'Учителят',
        topics: ['Трудностите'],
        text: 'Никой владика няма право да носи корона, ако преди това не е носил трънен венец.',
      },
      {
        source: 'Исак Лурия',
        topics: ['Трудностите'],
        text: 'В края изкуплението, не ставаш нов. Ставаш Древният, който никога не е бил изгубен. Всяка рана е врата към по-дълбоко Единство.',
      },
      {
        source: 'Зохар',
        topics: ['Истината'],
        text: 'Произходът е в Душата на човека, а не в историята на човечеството.',
      },
      {
        source: 'Кабала',
        topics: ['Божият Гняв', 'Злото'],
        text: 'Злото не може да унищожи света, защото то трябва да получи сила от Бога. Цялата сила е в Бога.',
      },
      {
        source: 'Исак Лурия',
        topics: ['Божият Гняв', 'Злото'],
        text: 'Злото е излязло от Дълбините на Бога, за да преустрои всичко.',
      },
      {
        source: 'Кабала',
        topics: ['Трудностите'],
        text: 'Всяко нещастие се труди, за да вкара човека в правия Път.',
      },
      {
        source: 'Кабала',
        topics: ['Молитвата'],
        text: 'Без нашите натрупани молитви - помощта няма да дойде.',
      },
      {
        source: 'Гносисът',
        topics: ['Любовта'],
        text: 'Да правиш нещо с Любов, означава - да му вдъхваш живот, защото Любовта е по-дълбока от живота.',
      },
      {
        source: 'Василид',
        topics: ['Духът'],
        text: 'Нашият Дух е по-дълбок от историята на света и на вселената.',
      },
      {
        source: 'Василид',
        topics: ['Духът', 'Любовта', 'Истината'],
        text: 'Истината изисква не да бъдеш религиозен или принадлежащ на някакъв народ. Истината изисква да бъдеш все повече Любов, все повече Дух',
      },
    ],
  })
}

main()
  .catch((e) => {
    console.error(e)
    process.exit(1)
  })
  .finally(async () => {
    await prisma.$disconnect()
  })
