import { PrismaClient } from '../app/generated/prisma'

const prisma = new PrismaClient()

export async function main() {
  await prisma.prayer.update({
    where: { id: 'dobrata-molitva' },
    data: {
      content: [
        'Господи, Боже наш, благи ни Небесен Баща, Кой­то си ни подарил живот и здраве да Ти се радваме, молим Ти се, изпроводи Духа Си да ни пази и закриля от всяко зло и лукаво помишление.',

        'Научи ни да правим Твоята Воля, да осветяваме Твоето име и да Те славословим винаги. Осветявай духа ни, просвещавай сърцата ни и ума ни, да пазим Твоите заповеди и повеления. Вдъхвай в нас с при­съствието Си чистите Си мисли и ни упътвай да Ти служим с радост.',

        'Животът си, който посвещаваме на Теб за добро­то на нашите братя и ближни. Ти благославяй. Пома­гай ни и ни съдействай да растем във всяко познание и мъдрост, да се учим от Твоето Слово и да пребъдва­ме в Твоята Истина.',

        'Ръководи ни във всичко, което мислим и вършим за Твоето име, да е за успеха на Царството Ти на Земята. Храни душите ни с Небесния Си хляб, укрепя­вай ни със Силата Си, да успяваме в живота си.',

        'Като ни даваш всичките Твои благословения, приложи и Любовта Си да ни е вечен закон. Защото на Тебе принадлежи Царството, Силата и Славата завинаги.',
        'Амин',
      ].join('\n\n'),
    },
  })

  console.log('Seed completed successfully')
}

main()
  .catch((e) => {
    console.error(e)
    process.exit(1)
  })
  .finally(async () => {
    await prisma.$disconnect()
  })
