import { PrismaClient } from '../app/generated/prisma'

const prisma = new PrismaClient()

export async function main() {
  await prisma.prayer.create({
    data: {
      id: 'patyat-na-jivota',
      title: 'Пътят на живота',
      source: 'Учителят',
      series: [
        'Молитвена Хранилница',
        'Наряди',
        'Вторник',
        'Молитвениче на Елена Андреева',
      ],
      content: [
        'Господи Боже, Спасителю наш, на всяка сила и крепост, на всяка Истина и Любов, на всяко държавие и власт, извор на всички добрини в живота ни, изпроводи ни благия Си Дух да ни ръководи и крепи в Пътя на Живота. Да ни просвещава умовете, да ни озарява сърцата, да ни дава сила и живот да струваме добрата Ти Воля.',
        'Прости прегрешенията ни, които изповядваме пред Теб, те ни отдалечиха от Твоята бащинска Любов. Изличи ги от книгата на Твоите възпоменания и ни дарувай мира на Твоя Дух.',
        'Направи сега да просветне Лицето Ти върху нас, да сме образ на Твоята Любов, вестители на Твоята Истина и служители на Твоята Правда.',
        'Благослови тоя народ, между който живеем. Благослови нашите братя, с които се подвизаваме. Благослови всички майки и бащи, които вършат Твоята Воля. Чуй гласа на всички страдующи по лицето на Земята и ги благослови.',
        'Благослови Учителя ни, Който ни води в Твоя Път.',
        'Благословен си ти Господи, Боже наш. Благословено е Твоето Име от веки, защото Ти си Пътят, Истината и Животът и освен Теб няма друг Бог. Ти си само Един.',
        'Амин.',
      ].join('\n\n'),
      notes: [
        'Тази молитва присъства както в Духовният Наряд за Седмицата, за Вторник, така и в Молитвената Хранилница от където е и това копие.',
        'В беседата „Пътят на живота“ от 1943 г. намираме следните думи от Учителя: „Един е пътят на живота – то е любовта. Един е пътят на живота – то е мъдростта. Един е пътят на живота – това е истината.“',
      ].join('\n\n'),
    },
  })
}

main()
  .catch((e) => {
    console.error(e)
    process.exit(1)
  })
  .finally(async () => {
    await prisma.$disconnect()
  })
