import { PrismaClient } from '../app/generated/prisma'

const prisma = new PrismaClient()

export async function main() {
  await prisma.wisdom.createMany({
    data: [
      {
        text: 'Най-хубавото в света е, от сутрин до вечер да мислиш за Бога.',
        source: 'Учителят',
        topics: ['Чистотата', 'Бога'],
      },
      {
        text: 'Силата на един човек седи в Истината, която той обича. Вие можете да обичате само това същество, което разширява съзнанието ви. Носете Бог в съзнанието си, ако искате да не грешите.',
        source: 'Учителят',
        topics: ['Истината', 'Бога'],
      },
      {
        text: 'Първото нещо е да бъдете господари на своите мрачни сили и да казвате: "Моят Дух им е Господар." Дойде ли ви лошо настроение, кажете: "Моят дух е Господар на тях!", и ще видите как ще победите.',
        source: 'Учителят',
        topics: ['Трудностите'],
      },
      {
        text: 'Човек е свободен само в Любовта! Вън от Любовта, той няма никаква свобода! Любовта е първият образ на Бога.',
        source: 'Учителят',
        topics: ['Любовта', 'Бога', 'Свободата'],
      },
      {
        text: 'Като дойде напрежението, без тревога!',
        source: 'Учителят',
        topics: ['Трудностите'],
      },
      {
        text: 'Никога не трябва да даваме място в ума си на лоша мисъл, защото тя ще изработи своя форма, и в бъдеще, когато и да е - ще те намери и ще те спъне.',
        source: 'Учителят',
        topics: ['Чистотата'],
      },
      {
        text: 'Ако вие се гневите, допускате зло - вие ми давате сила.',
        source: 'Учителят',
        topics: ['Чистотата', 'Злото'],
      },
      {
        text: 'Бог ви е дал свободен избор, за да направите правилния избор.',
        source: 'Учителят',
        topics: ['Свободата'],
      },
      {
        text: 'Мислите ли, че дяволът върши каквото иска? Дяволът и той служи на Бога.',
        source: 'Учителят',
        topics: ['Злото'],
      },
      {
        text: 'Непременно ще минете през своя минал живот. Какъвто и да е стремежът ви, вие трябва да оправите грешките на своя минал живот.',
        source: 'Учителят',
        topics: ['Трудностите'],
      },
      {
        text: 'Щастието прави човека - нещастен! Щастието ти е в онзи, който те обича.',
        source: 'Учителят',
        topics: ['Щастието'],
      },
      {
        text: 'Как да се справяме с лошите мисли? Ще се качвате на планините.',
        source: 'Учителят',
        topics: ['Трудностите', 'Чистотата'],
      },
      {
        text: 'Според вашите мисли и желания, вие привличате или ниши, или висши същества. И човек може да си мисли, че е свободен или не е - все те го ръководят.',
        source: 'Учителят',
        topics: ['Свободата', 'Чистотата'],
      },
      {
        text: 'Докато във вашето съзнание има Единство - никакво страдание не може да дойде. От раздвояване на съзнанието, съмнението.',
        source: 'Учителят',
        topics: ['Свободата', 'Чистотата'],
      },
    ],
  })
}

main()
  .catch((e) => {
    console.error(e)
    process.exit(1)
  })
  .finally(async () => {
    await prisma.$disconnect()
  })
