export default function Page() {
  return (
    <article>
      <p className="text-xl">
        Най-хубавото упражнение в живота на човека е молитвата. За сега, в
        света, по-хубаво упражнение от молитвата няма.
      </p>

      <p>
        Често, когато плодовете на дърветата падат, децата държат калпаците си
        под дърветата отдолу, та плодовете да падат вътре. Едно от децата
        разтърсва дървото, а другите държат калпаците си отдолу и събират
        плодовете. И българинът представлява една такава захлупена шапка. Това
        обаче са останки от миналото. Всеки народ си има своите етически
        останки, навици от миналите векове, които трябва да преобразува.
        Вземете, за пример, твърдението, което съществува в българина, пък и във
        всички народи почти, че човек трябва да се моли само когато има
        разположение. Защо човек трябва да се моли само когато има разположение?
        Ако това е правило, тогава човек трябва да говори пак само когато е
        разположен.
      </p>
    </article>
  )
}
